# Brewfile - run with: brew bundle --file=Brewfile
# Core dev environment for macOS (Ghostty + tmux + LazyVim + modern CLI)

# --- Taps ---
# (font casks live in the main cask repo since homebrew/cask-fonts was merged)

# --- CLI tools ---
brew "stow"          # symlink-based dotfiles manager
brew "neovim"        # editor (LazyVim requires >= 0.11.2)
brew "tmux"          # terminal multiplexer
brew "fzf"           # fuzzy finder
brew "ripgrep"       # fast grep (rg)
brew "fd"            # fast find
brew "bat"           # cat with syntax highlighting
brew "eza"           # modern ls
brew "zoxide"        # smarter cd
brew "starship"      # cross-shell prompt
brew "lazygit"       # terminal git UI
brew "sesh"          # smart tmux session manager (zoxide + fzf)
brew "git-delta"     # better git diffs
brew "gh"            # GitHub CLI
brew "jq"            # JSON processor
brew "tree-sitter"   # parsers for nvim-treesitter

# --- Casks ---
cask "ghostty"                          # GPU-accelerated terminal
cask "font-jetbrains-mono-nerd-font"    # Nerd Font for icons/glyphs
